Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F30C.tmx
Source language: en_us
Languages: zh_cn

source: Wolf Families
zh_cn: 狼的家庭

source: Wolves live in family groups called packs.
zh_cn: 狼以家庭为单位群居生活。

source: A pack is usually made up of a male parent, a female parent and their pups from the last few years.
zh_cn: 一群狼通常由父狼、母狼和它们最近几年产下的幼崽组成。

source: Usually, four to six pups are born together in a litter.
zh_cn: 一般说来，狼一胎能产下四到六只幼崽。

source: The pups in a litter are called litter mates.
zh_cn: 同一胎生的幼崽即被称作同窝出生者（litter mate）。

source: Their first home is usually a den, which can be a small cave or a hole dug in the ground.
zh_cn: 它们的第一个小家是兽穴，即在地上刨出的坑或洞。

source: It must be big enough to shelter the mother and pups from weather and protect the pups from other animals that may want to hurt them.
zh_cn: 兽穴必须足以容下狼妈妈和幼崽，供它们遮风挡雨，同时保护小崽们不受其他动物的伤害。

source: Packs sometimes use the same den for several years, or they may find a new den each year.
zh_cn: 有时狼会一直使用一个兽穴，但也可能每年建造新的。

source: Pups grow inside their mother for about 63 days before they are born.
zh_cn: 狼宝宝在妈妈肚子里待上63天，就来到了这个世上。

source: At birth, they weigh only one pound, and their eyes are closed.
zh_cn: 刚出生时它们只有一磅重（约0.453千克），眼睛也没睁开。

source: Pups grow quickly.
zh_cn: 幼崽们长得很快。

source: About 10 to 14 days after they are born, they open their eyes.
zh_cn: 出生10到14天后，它们就睁开了眼睛。

source: By two weeks of age, the pups can waddle, and about a week after that, they may come out of the den for the first time.
zh_cn: 两周大时，就可以摇摇晃晃地走路；再过一周，就可以第一次走出兽穴。

source: At first, they live only on milk from their mother. By three weeks of age, they start eating meat.
zh_cn: 开始，幼崽只喝妈妈的奶，到了三周大时，它们开始吃肉。

source: Since pups are too young to hunt, adult wolves bring meat to them in their stomachs.
zh_cn: 幼崽太小，不能捕猎，成年的狼就用胃中半消化的肉喂它们。

source: The pups lick around the mouth of the adult when it returns from the hunt, and the food comes back up into the adult\'s mouth.
zh_cn: 父母捕猎回来，幼崽们会去舔爸爸妈妈的嘴巴，于是父母狼就把肉吐出来。

source: This sounds terrible to us, but wolf pups love it!
zh_cn: 这在我们看来很可怕，但是狼宝宝非常喜欢！

source: The pups eat the regurgitated meat within seconds.
zh_cn: 它们一转眼就能吃光这些半消化的肉。

source: Any pup who is less aggressive than his or her brothers and sisters gets less food.
zh_cn: 任何一只不像其它兄弟姐妹一样争先恐后的幼崽只能得到较少的食物。

source: If pups are too persistent in their begging for food, adult wolves may growl to warn them to stop.
zh_cn: 如果幼崽没完没了地索要食物，成年狼就会发出低吼，警告它们老实一点。

source: The adults may also leave the area in an attempt to avoid the pups.
zh_cn: 或者成年狼会直接离开兽穴，以免幼崽吃光它胃中的食物。

source: All the wolves in a pack help take care of the pups.
zh_cn: 狼群中所有的狼会互相帮助，照顾彼此的幼崽。

source: When the pups are very small, other pack members bring food to the mother so she does not have to leave the den.
zh_cn: 如果狼宝宝太小，狼群的其他成员会给狼妈妈带来食物，这样她就不用离开巢穴。

source: When the pups are a little larger, pack members take turns bringing them food, playing with them and even baby-sitting.
zh_cn: 等幼崽长大一点以后，群中成员轮流给幼崽打食、陪它们玩耍甚至给它们当保姆。

source: Once the pups are about eight weeks old, the adults leave the den and take the pups to a rendezvous site.
zh_cn: 一旦幼崽长到八周大，狼父母就离开巢穴，把幼狼带到狼群的集会地。

source: In this open area, the wolves gather to sleep, play, eat and just hang out.
zh_cn: 在这个公共的地盘，狼群在一起睡觉、嬉戏、进食或者只是蹓跶。

source: Until the pups are old enough to go with the adults, they stay at the rendezvous site.
zh_cn: 幼狼一直生活在这个集会地，直到它们能够和父母一同出猎。

source: Often, one of the adult wolves stays with the pups to watch over them.
zh_cn: 通常情况下，打猎时父母中的一方会留下来守着幼狼。

source: Wolf pups love to play.
zh_cn: 幼狼喜欢玩耍。

source: The pups will play with each other and their older brothers and sisters, stalking and pouncing on each other.
zh_cn: 它们和同窝的伙伴，也和年长一些的兄弟姐妹们一起玩，蹑手蹑脚地接近对方，然后猛扑上去。

source: This type of play will help them all their lives, as it is practice for stalking and killing prey and learning the social interactions of the pack.
zh_cn: 这类游戏让它们终生受益，因为这是今后潜伏和猎杀的演练，并且是在学习与群体成员的社会交际。

source: Pups will also play with \"toys\" like bones, feathers or the skins of dead animals.
zh_cn: 幼狼还喜欢玩“玩具”，骨头啊，羽毛啊，或者死动物的皮。

source: They \"kill\" the toys over and over again and carry them around as trophies.
zh_cn: 它们一遍又一遍地“猎杀”自己的玩具，并把它们当作猎物叼在嘴里，昂首阔步。

source: As they get larger, they will use the skills they learned from this play as they begin to hunt small animals, like rabbits.
zh_cn: 等到它们再大一些，开始捕杀兔子之类的小型动物时，就会应用这些游戏中的技能。

source: When pups are six months old, they will start hunting larger animals with the rest of the pack.
zh_cn: 幼狼六个月大时，就会开始和群体中的其他成员一起捕猎更大的动物。

source: In what ways are wolf families like human families?
zh_cn: 狼和人的家庭有哪些方面的不同呢？

source: How are they different?
zh_cn: 这两者的差异又有多大？
